# Glazing Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Glazing Class
Members See Also
---
A static class that provides access to the property names that appear in the Glazing visual asset schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static class Glazing
```

Visual Basic
---
```text
Public NotInheritable Class Glazing
```

Visual C++
---
```text
public ref class Glazing abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Visual..::..Glazing
# See Also
Glazing Members
Autodesk.Revit.DB.Visual Namespace